app/controllers/stocks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."symbol" = ? AND "stocks"."user_id" = ? LIMIT ?  [["symbol", "fb"], ["user_id", 1], ["LIMIT", 1]]
INSERT INTO "stocks" ("symbol", "user_shares", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["symbol", "fb"], ["user_shares", 1], ["user_id", 1], ["created_at", "2018-11-29 16:08:45.780162"], ["updated_at", "2018-11-29 16:08:45.780162"]]
INSERT INTO "trades" ("amount", "price", "symbol", "user_id", "stock_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["amount", 1], ["price", 136.68], ["symbol", "fb"], ["user_id", 1], ["stock_id", 1], ["created_at", "2018-11-29 16:08:45.785124"], ["updated_at", "2018-11-29 16:08:45.785124"]]
UPDATE "balances" SET "balance" = ?, "updated_at" = ? WHERE "balances"."id" = ?  [["balance", 4863.32], ["updated_at", "2018-11-29 16:08:45.794924"], ["id", 1]]
UPDATE "stocks" SET "user_shares" = ?, "updated_at" = ? WHERE "stocks"."id" = ?  [["user_shares", 2], ["updated_at", "2018-11-29 19:24:01.405252"], ["id", 1]]
---
  def create
    user = User.find_by(id: params[:user_id])
    trade_amount = params[:user_shares].to_i * params[:stock_price].to_f
    stock = Stock.find_by(symbol: stock_params[:symbol], user_id: params[:user_id])
    if stock != nil
      stock.user_shares = stock.user_shares + stock_params[:user_shares].to_i
    else
      stock = Stock.new(stock_params)
    end
    trade = stock.trades.build(user_id: current_user.id, amount: params[:user_shares], price: params[:stock_price], symbol: stock_params[:symbol])
    new_balance = (current_user.balance.balance - trade_amount)
    user.balance.balance = new_balance
      if stock.save && trade.save && user.balance.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    binding.remote_pry
    user = User.find_by(id: params[:user_id])