app/controllers/users_controller.rb

INSERT INTO "balances" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 1], ["created_at", "2018-11-29 15:40:40.615664"], ["updated_at", "2018-11-29 15:40:40.615664"]]
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    user = User.new(user_params)
    if user.save && user.create_balance

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    user = User.find_by(id: params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    user = User.find_by(id: params[:id])